---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.CreatePartsWithInvalidService
source: html/25f4466d-4d97-7e2c-b18e-ac36a68c13db.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.CreatePartsWithInvalidService Property

Parts were not created because a system's service is undefined.

## Syntax (C#)
```csharp
public static FailureDefinitionId CreatePartsWithInvalidService { get; }
```